#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keyvault.azurerm_key_vault.vault will be created
  + resource "azurerm_key_vault" "vault" {
      + access_policy               = (known after apply)
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "eastus2"
      + name                        = "kv-dev-main"
      + purge_protection_enabled    = false
      + resource_group_name         = "rg-dev-main"
      + sku_name                    = "standard"
      + soft_delete_retention_days  = 7
      + tags                        = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
        }
      + tenant_id                   = "097cc2fc-b9fb-4f07-80b7-eab5694ad4fc"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Deny"
        }
    }

  # module.network.azurerm_subnet.subnet["subnet-1"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "subnet-1"
      + resource_group_name                            = "rg-dev-main"
      + virtual_network_name                           = "vnet-dev-main"
    }

  # module.network.azurerm_subnet.subnet["subnet-2"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "subnet-2"
      + resource_group_name                            = "rg-dev-main"
      + virtual_network_name                           = "vnet-dev-main"
    }

  # module.network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = []
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "vnet-dev-main"
      + resource_group_name = "rg-dev-main"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
        }
    }

  # module.resource_group.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "eastus2"
      + name     = "rg-dev-main"
      + tags     = {
          + "Environment" = "Development"
          + "ManagedBy"   = "Terraform"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + key_vault_id            = (known after apply)
  + key_vault_name          = "kv-dev-main"
  + key_vault_uri           = (sensitive value)
  + resource_group_id       = (known after apply)
  + resource_group_location = "eastus2"
  + resource_group_name     = "rg-dev-main"
  + subnet_ids              = {
      + subnet-1 = (known after apply)
      + subnet-2 = (known after apply)
    }
  + vnet_id                 = (known after apply)
  + vnet_name               = "vnet-dev-main"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>